updated the readme with mermaid
